BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64RFR2.PIC
        <edc:SFRDef edc:_addr="0x37" edc:access="-----nnn" edc:cname="TIFR2" edc:nzwidth="0x8" ltx:memberofperipheral="TC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOV2" edc:desc="Timer/Counter2 Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF2A" edc:desc="Output Compare Flag 2 A" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF2B" edc:desc="Output Compare Flag 2 B" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x38" edc:access="--n-nnnn" edc:cname="TIFR3" edc:nzwidth="0x8" ltx:memberofperipheral="TC3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOV3" edc:desc="Timer/Counter3 Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF3A" edc:desc="Timer/Counter3 Output Compare A Match Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF3B" edc:desc="Timer/Counter3 Output Compare B Match Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF3C" edc:desc="Timer/Counter3 Output Compare C Match Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICF3" edc:desc="Timer/Counter3 Input Capture Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x39" edc:access="--n-nnnn" edc:cname="TIFR4" edc:nzwidth="0x8" ltx:memberofperipheral="TC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOV4" edc:desc="Timer/Counter4 Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF4A" edc:desc="Timer/Counter4 Output Compare A Match Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF4B" edc:desc="Timer/Counter4 Output Compare B Match Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF4C" edc:desc="Timer/Counter4 Output Compare C Match Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICF4" edc:desc="Timer/Counter4 Input Capture Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x3A" edc:access="--n-nnnn" edc:cname="TIFR5" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOV5" edc:desc="Timer/Counter5 Overflow Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF5A" edc:desc="Timer/Counter5 Output Compare A Match Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF5B" edc:desc="Timer/Counter5 Output Compare B Match Flag" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OCF5C" edc:desc="Timer/Counter5 Output Compare C Match Flag" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICF5" edc:desc="Timer/Counter5 Input Capture Flag" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x3B" edc:access="-----nnn" edc:cname="PCIFR" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCIF" edc:desc="Pin Change Interrupt Flags" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x3C" edc:access="nnnnnnnn" edc:cname="EIFR" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INTF" edc:desc="External Interrupt Flag" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No edge or logic change on INT7:0 occurred." edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="A edge or logic change on INT0 occurred and triggered an interrupt request." edc:when="(field &amp; 0xFF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="..." edc:when="(field &amp; 0xFF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x80" edc:desc="A edge or logic change on INT7 occurred and triggered an interrupt request." edc:when="(field &amp; 0xFF) == 0x80"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x3D" edc:access="nnnnnnnn" edc:cname="EIMSK" edc:nzwidth="0x8" ltx:memberofperipheral="EXINT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT" edc:desc="External Interrupt Request Enable" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="All external pin interrupts are disabled." edc:when="(field &amp; 0xFF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xff" edc:desc="All external pin interrupts are enabled." edc:when="(field &amp; 0xFF) == 0xff"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x3E" edc:access="nnnnnnnn" edc:cname="GPIOR0" edc:nzwidth="0x8" ltx:memberofperipheral="CPU">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GPIOR00" edc:desc="General Purpose I/O Register 0 Value" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR01" edc:desc="General Purpose I/O Register 0 Value" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR02" edc:desc="General Purpose I/O Register 0 Value" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR03" edc:desc="General Purpose I/O Register 0 Value" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR04" edc:desc="General Purpose I/O Register 0 Value" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR05" edc:desc="General Purpose I/O Register 0 Value" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR06" edc:desc="General Purpose I/O Register 0 Value" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GPIOR07" edc:desc="General Purpose I/O Register 0 Value" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
