BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64RFR2.PIC
        <edc:SFRDef edc:_addr="0xD8" edc:access="nnnnnnnn" edc:cname="SCRSTRLH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCRSTRLH" edc:desc="Symbol Counter Received Frame Timestamp Register LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xD9" edc:access="nnnnnnnn" edc:cname="SCRSTRHL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCRSTRHL" edc:desc="Symbol Counter Received Frame Timestamp Register HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDA" edc:access="nnnnnnnn" edc:cname="SCRSTRHH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCRSTRHH" edc:desc="Symbol Counter Received Frame Timestamp Register HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDB" edc:access="--nnnnnn" edc:cname="SCCSR" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCS1" edc:desc="Symbol Counter Compare Source select register for Compare Units" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Compare Unit 1 Relative Compare Source = Beacon Timestamp Register" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Compare Unit 1 Relative Compare Source = Transmit Frame Timestamp Register" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Compare Unit 1 Relative Compare Source = Received Frame Timestamp Register" edc:when="(field &amp; 0x3) == 2"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SCCS2" edc:desc="Symbol Counter Compare Source select register for Compare Unit 2" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Compare Unit 2 Relative Compare Source = Beacon Timestamp Register" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Compare Unit 2 Relative Compare Source = Transmit Frame Timestamp Register" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Compare Unit 2 Relative Compare Source = Received Frame Timestamp Register" edc:when="(field &amp; 0x3) == 2"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SCCS3" edc:desc="Symbol Counter Compare Source select register for Compare Unit 3" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Compare Unit 3 Relative Compare Source = Beacon Timestamp Register" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Compare Unit 3 Relative Compare Source = Transmit Frame Timestamp Register" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Compare Unit 3 Relative Compare Source = Received Frame Timestamp Register" edc:when="(field &amp; 0x3) == 2"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDC" edc:access="nnnnnnnn" edc:cname="SCCR0" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCMP" edc:desc="Symbol Counter Compare Unit 3 Mode select" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="SCTSE" edc:desc="Symbol Counter Automatic Timestamping enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCCKSEL" edc:desc="Symbol Counter Clock Source select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCEN" edc:desc="Symbol Counter enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCMBTS" edc:desc="Manual Beacon Timestamp" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCRES" edc:desc="Symbol Counter Synchronization" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDD" edc:access="nnnnnnnn" edc:cname="SCCR1" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCENBO" edc:desc="Backoff Slot Counter enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCEECLK" edc:desc="Enable External Clock Source on PG2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCCKDIV" edc:desc="Clock divider for synchronous clock source (16MHz Transceiver Clock)" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Transceiver Clock divided by 256, (62.5kHz)" edc:when="(field &amp; 0x7) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Transceiver Clock divided by 128, (125kHz)" edc:when="(field &amp; 0x7) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Transceiver Clock divided by 64,  (250kHz)" edc:when="(field &amp; 0x7) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Transceiver Clock divided by 32,  (500kHz)" edc:when="(field &amp; 0x7) == 3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_4" edc:desc="Transceiver Clock divided by 16,  (1MHz)" edc:when="(field &amp; 0x7) == 4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_5" edc:desc="Transceiver Clock divided by 8,   (2MHz)" edc:when="(field &amp; 0x7) == 5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_6" edc:desc="Transceiver Clock divided by 4,   (4MHz)" edc:when="(field &amp; 0x7) == 6"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="SCBTSM" edc:desc="Symbol Counter Beacon Timestamp Mask Register" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res" edc:desc="Reserved Bit" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDE" edc:access="-------n" edc:cname="SCSR" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCBSY" edc:desc="Symbol Counter busy" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xDF" edc:access="---nnnnn" edc:cname="SCIRQM" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IRQMCP" edc:desc="Symbol Counter Compare Match 3 IRQ enable" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="IRQMOF" edc:desc="Symbol Counter Overflow IRQ enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQMBO" edc:desc="Backoff Slot Counter IRQ enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE0" edc:access="---nnnnn" edc:cname="SCIRQS" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IRQSCP" edc:desc="Compare Unit 3 Compare Match IRQ" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="IRQSOF" edc:desc="Symbol Counter Overflow IRQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRQSBO" edc:desc="Backoff Slot Counter IRQ" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE1" edc:access="nnnnnnnn" edc:cname="SCCNTLL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCNTLL" edc:desc="Symbol Counter Register LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE2" edc:access="nnnnnnnn" edc:cname="SCCNTLH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCNTLH" edc:desc="Symbol Counter Register LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE3" edc:access="nnnnnnnn" edc:cname="SCCNTHL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCNTHL" edc:desc="Symbol Counter Register HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE4" edc:access="nnnnnnnn" edc:cname="SCCNTHH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCCNTHH" edc:desc="Symbol Counter Register HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE5" edc:access="nnnnnnnn" edc:cname="SCBTSRLL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCBTSRLL" edc:desc="Symbol Counter Beacon Timestamp Register LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
