BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64RFR2.PIC
        <edc:SFRDef edc:_addr="0xE6" edc:access="nnnnnnnn" edc:cname="SCBTSRLH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCBTSRLH" edc:desc="Symbol Counter Beacon Timestamp Register LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE7" edc:access="nnnnnnnn" edc:cname="SCBTSRHL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCBTSRHL" edc:desc="Symbol Counter Beacon Timestamp Register HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE8" edc:access="nnnnnnnn" edc:cname="SCBTSRHH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCBTSRHH" edc:desc="Symbol Counter Beacon Timestamp Register HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xE9" edc:access="nnnnnnnn" edc:cname="SCTSRLL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSRLL" edc:desc="Symbol Counter Frame Timestamp Register LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEA" edc:access="nnnnnnnn" edc:cname="SCTSRLH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSRLH" edc:desc="Symbol Counter Frame Timestamp Register LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEB" edc:access="nnnnnnnn" edc:cname="SCTSRHL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSRHL" edc:desc="Symbol Counter Frame Timestamp Register HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEC" edc:access="nnnnnnnn" edc:cname="SCTSRHH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCTSRHH" edc:desc="Symbol Counter Frame Timestamp Register HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xED" edc:access="nnnnnnnn" edc:cname="SCOCR3LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3LL" edc:desc="Symbol Counter Output Compare Register 3 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEE" edc:access="nnnnnnnn" edc:cname="SCOCR3LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3LH" edc:desc="Symbol Counter Output Compare Register 3 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xEF" edc:access="nnnnnnnn" edc:cname="SCOCR3HL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3HL" edc:desc="Symbol Counter Output Compare Register 3 HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF0" edc:access="nnnnnnnn" edc:cname="SCOCR3HH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR3HH" edc:desc="Symbol Counter Output Compare Register 3 HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF1" edc:access="nnnnnnnn" edc:cname="SCOCR2LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2LL" edc:desc="Symbol Counter Output Compare Register 2 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF2" edc:access="nnnnnnnn" edc:cname="SCOCR2LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2LH" edc:desc="Symbol Counter Output Compare Register 2 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF3" edc:access="nnnnnnnn" edc:cname="SCOCR2HL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2HL" edc:desc="Symbol Counter Output Compare Register 2 HL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF4" edc:access="nnnnnnnn" edc:cname="SCOCR2HH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR2HH" edc:desc="Symbol Counter Output Compare Register 2 HH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF5" edc:access="nnnnnnnn" edc:cname="SCOCR1LL" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1LL" edc:desc="Symbol Counter Output Compare Register 1 LL-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xF6" edc:access="nnnnnnnn" edc:cname="SCOCR1LH" edc:nzwidth="0x8" ltx:memberofperipheral="SYMCNT">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SCOCR1LH" edc:desc="Symbol Counter Output Compare Register 1 LH-Byte" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
