BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64RFR2.PIC
        <edc:SFRDef edc:_addr="0x112" edc:access="nnnnnnnn" edc:cname="MAFSA1L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA1L" edc:desc="MAC Short Address low Byte for Frame Filter 1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x113" edc:access="nnnnnnnn" edc:cname="MAFSA1H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA1H" edc:desc="MAC Short Address high Byte for Frame Filter 1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x114" edc:access="nnnnnnnn" edc:cname="MAFPA1L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA1L" edc:desc="MAC Personal Area Network ID low Byte for Frame Filter 1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x115" edc:access="nnnnnnnn" edc:cname="MAFPA1H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA1H" edc:desc="MAC Personal Area Network ID high Byte for Frame Filter 1" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x116" edc:access="nnnnnnnn" edc:cname="MAFSA2L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA2L" edc:desc="MAC Short Address low Byte for Frame Filter 2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x117" edc:access="nnnnnnnn" edc:cname="MAFSA2H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA2H" edc:desc="MAC Short Address high Byte for Frame Filter 2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x118" edc:access="nnnnnnnn" edc:cname="MAFPA2L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA2L" edc:desc="MAC Personal Area Network ID low Byte for Frame Filter 2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x119" edc:access="nnnnnnnn" edc:cname="MAFPA2H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA2H" edc:desc="MAC Personal Area Network ID high Byte for Frame Filter 2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x11A" edc:access="nnnnnnnn" edc:cname="MAFSA3L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA3L" edc:desc="MAC Short Address low Byte for Frame Filter 3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x11B" edc:access="nnnnnnnn" edc:cname="MAFSA3H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFSA3H" edc:desc="MAC Short Address high Byte for Frame Filter 3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x11C" edc:access="nnnnnnnn" edc:cname="MAFPA3L" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA3L" edc:desc="MAC Personal Area Network ID low Byte for Frame Filter 3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x11D" edc:access="nnnnnnnn" edc:cname="MAFPA3H" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MAFPA3H" edc:desc="MAC Personal Area Network ID high Byte for Frame Filter 3" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x11E" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x120" edc:access="nnnnnnnn" edc:cname="TCCR5A" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WGM5" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Normal mode of operation" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="PWM, phase correct, 8-bit" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="PWM, phase correct, 9-bit" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x3" edc:desc="PWM, phase correct, 10-bit" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="Fast PWM, 8-bit" edc:when="(field &amp; 0x3) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Fast PWM, 9-bit" edc:when="(field &amp; 0x3) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Fast PWM, 10-bit" edc:when="(field &amp; 0x3) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x8" edc:desc="PWM, Phase and frequency correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x9" edc:desc="PWM, Phase and frequency correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA" edc:desc="PWM, Phase correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xA"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB" edc:desc="PWM, Phase correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xB"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xC"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xD" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0xD"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="Fast PWM, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Fast PWM, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM5C" edc:desc="Compare Output Mode for Channel C" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM5B" edc:desc="Compare Output Mode for Channel B" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="COM5A" edc:desc="Compare Output Mode for Channel A" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Normal operation" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x121" edc:access="nn-nnnnn" edc:cname="TCCR5B" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS5" edc:desc="Clock Select" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="No clock source (Timer/Counter stopped)" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="clk_IO/1 (no prescaling)" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="clk_IO/8 (from prescaler)" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="clk_IO/64 (from prescaler)" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x04" edc:desc="clk_IO/256 (from prescaler)" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x05" edc:desc="clk_IO/1024 (from prescaler)" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x06" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x07" edc:desc="Reserved" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="WGM5" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x0" edc:desc="Normal mode of operation" edc:when="(field &amp; 0x3) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="PWM, phase correct, 8-bit" edc:when="(field &amp; 0x3) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="PWM, phase correct, 9-bit" edc:when="(field &amp; 0x3) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x3" edc:desc="PWM, phase correct, 10-bit" edc:when="(field &amp; 0x3) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x5" edc:desc="Fast PWM, 8-bit" edc:when="(field &amp; 0x3) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x6" edc:desc="Fast PWM, 9-bit" edc:when="(field &amp; 0x3) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x7" edc:desc="Fast PWM, 10-bit" edc:when="(field &amp; 0x3) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x8" edc:desc="PWM, Phase and frequency correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x9" edc:desc="PWM, Phase and frequency correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xA" edc:desc="PWM, Phase correct, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xA"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xB" edc:desc="PWM, Phase correct, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xB"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xC" edc:desc="CTC, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xC"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xD" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0xD"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="Fast PWM, TOP = ICRn" edc:when="(field &amp; 0x3) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Fast PWM, TOP = OCRnA" edc:when="(field &amp; 0x3) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ICES5" edc:desc="Input Capture 5 Edge Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICNC5" edc:desc="Input Capture 5 Noise Canceller" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x122" edc:access="nnn-----" edc:cname="TCCR5C" edc:nzwidth="0x8" ltx:memberofperipheral="TC5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="FOC5C" edc:desc="Force Output Compare for Channel C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC5B" edc:desc="Force Output Compare for Channel B" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FOC5A" edc:desc="Force Output Compare for Channel A" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x123" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x124" edc:access="nnnnnnnnnnnnnnnn" edc:cname="TCNT5" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x126" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ICR5" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x128" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5A" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x12A" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5B" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:SFRDef edc:_addr="0x12C" edc:access="nnnnnnnnnnnnnnnn" edc:cname="OCR5C" edc:nzwidth="0x10" ltx:memberofperipheral="TC5"/>
        <edc:AdjustPoint edc:_addr="0x12E" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x12F" edc:access="--nnnnnn" edc:cname="LLCR" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LLENCAL" edc:desc="Enable Automatic Calibration" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLSHORT" edc:desc="Short Lower Calibration Circuit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLTCO" edc:desc="Temperature Coefficient of Current Source" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLCAL" edc:desc="Calibration Active" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLCOMP" edc:desc="Comparator Output" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LLDONE" edc:desc="Calibration Done" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x130" edc:access="----nnnn" edc:cname="LLDRL" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LLDRL" edc:desc="Low-Byte Data Register Bits" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Calibration limit for fast process corner/high output voltage" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x08" edc:desc="Calibration limit for slow process corner/low output voltage" edc:when="(field &amp; 0xF) == 0x08"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x131" edc:access="---nnnnn" edc:cname="LLDRH" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LLDRH" edc:desc="High-Byte Data Register Bits" edc:nzwidth="0x5">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Calibration limit for fast process corner/high output voltage" edc:when="(field &amp; 0x1F) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x10" edc:desc="Calibration limit for slow process corner/low output voltage" edc:when="(field &amp; 0x1F) == 0x10"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x132" edc:access="--nn----" edc:cname="DRTRAM3" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ENDRT" edc:desc="Enable SRAM Data Retention" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DRTSWOK" edc:desc="DRT Switch OK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x133" edc:access="--nn----" edc:cname="DRTRAM2" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ENDRT" edc:desc="Enable SRAM Data Retention" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DRTSWOK" edc:desc="DRT Switch OK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x134" edc:access="--nn----" edc:cname="DRTRAM1" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ENDRT" edc:desc="Enable SRAM Data Retention" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DRTSWOK" edc:desc="DRT Switch OK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x135" edc:access="--nn----" edc:cname="DRTRAM0" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="ENDRT" edc:desc="Enable SRAM Data Retention" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DRTSWOK" edc:desc="DRT Switch OK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x136" edc:access="nnnnnnnn" edc:cname="DPDS0" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PBDRV" edc:desc="Driver Strength Port B" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PDDRV" edc:desc="Driver Strength Port D" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PEDRV" edc:desc="Driver Strength Port E" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFDRV" edc:desc="Driver Strength Port F" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x137" edc:access="------nn" edc:cname="DPDS1" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PGDRV" edc:desc="Driver Strength Port G" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="PAD_IO_2MA" edc:desc="2 mA" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_4MA" edc:desc="4 mA" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_6MA" edc:desc="6 mA" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PAD_IO_8MA" edc:desc="8 mA" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
