BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64RFR2.PIC
        <edc:SFRDef edc:_addr="0x138" edc:access="nnnnnnnn" edc:cname="PARCR" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PARUFI" edc:desc="Power Amplifier Ramp Up Frequency Inversion" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PARDFI" edc:desc="Power Amplifier Ramp Down Frequency Inversion" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PALTU" edc:desc="ext. PA Ramp Up Lead Time" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="PALTU_MINUS_3US" edc:desc="-3us" edc:when="(field &amp; 0x7) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PALTU_MINUS_2US" edc:desc="-2us" edc:when="(field &amp; 0x7) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PALTU_MINUS_1US" edc:desc="-1us" edc:when="(field &amp; 0x7) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PALTU_0US" edc:desc="0us" edc:when="(field &amp; 0x7) == 3"/>
                <edc:SFRFieldSemantic edc:cname="PALTU_1US" edc:desc="1us" edc:when="(field &amp; 0x7) == 4"/>
                <edc:SFRFieldSemantic edc:cname="PALTU_2US" edc:desc="2us" edc:when="(field &amp; 0x7) == 5"/>
                <edc:SFRFieldSemantic edc:cname="PALTU_3US" edc:desc="3us" edc:when="(field &amp; 0x7) == 6"/>
                <edc:SFRFieldSemantic edc:cname="PALTU_4US" edc:desc="4us" edc:when="(field &amp; 0x7) == 7"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PALTD" edc:desc="ext. PA Ramp Down Lead Time" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="PALTD_MINUS_3US" edc:desc="-3us" edc:when="(field &amp; 0x7) == 0"/>
                <edc:SFRFieldSemantic edc:cname="PALTD_MINUS_2US" edc:desc="-2us" edc:when="(field &amp; 0x7) == 1"/>
                <edc:SFRFieldSemantic edc:cname="PALTD_MINUS_1US" edc:desc="-1us" edc:when="(field &amp; 0x7) == 2"/>
                <edc:SFRFieldSemantic edc:cname="PALTD_0US" edc:desc="0us" edc:when="(field &amp; 0x7) == 3"/>
                <edc:SFRFieldSemantic edc:cname="PALTD_1US" edc:desc="1us" edc:when="(field &amp; 0x7) == 4"/>
                <edc:SFRFieldSemantic edc:cname="PALTD_2US" edc:desc="2us" edc:when="(field &amp; 0x7) == 5"/>
                <edc:SFRFieldSemantic edc:cname="PALTD_3US" edc:desc="3us" edc:when="(field &amp; 0x7) == 6"/>
                <edc:SFRFieldSemantic edc:cname="PALTD_4US" edc:desc="4us" edc:when="(field &amp; 0x7) == 7"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x139" edc:access="------nn" edc:cname="TRXPR" edc:nzwidth="0x8" ltx:memberofperipheral="PWRCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRXRST" edc:desc="Force Transceiver Reset" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLPTR" edc:desc="Multi-purpose Transceiver Control Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x13A" edc:offset="0x2"/>
        <edc:SFRDef edc:_addr="0x13C" edc:access="n-n-nn--" edc:cname="AES_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="AES_IM" edc:desc="AES Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_DIR" edc:desc="Set AES Operation Direction" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AES_DIR_ENC" edc:desc="AES operation is encryption." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AES_DIR_DEC" edc:desc="AES operation is decryption." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_MODE" edc:desc="Set AES Operation Mode" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AES_MODE_ECB" edc:desc="AES Mode is ECB (Electronic Code Book)." edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AES_MODE_CBC" edc:desc="AES Mode is CBC (Cipher Block Chaining)." edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AES_REQUEST" edc:desc="Request AES Operation." edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x13D" edc:access="n------n" edc:cname="AES_STATUS" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AES_DONE" edc:desc="AES Operation Finished with Success" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="AES_ER" edc:desc="AES Operation Finished with Error" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x13E" edc:access="nnnnnnnn" edc:cname="AES_STATE" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AES_STATE" edc:desc="AES Plain and Cipher Text Buffer" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x13F" edc:access="nnnnnnnn" edc:cname="AES_KEY" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AES_KEY" edc:desc="AES Encryption/Decryption Key Buffer" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
