BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega64RFR2.PIC
        <edc:SFRDef edc:_addr="0x152" edc:access="nnnnnnnn" edc:cname="XOSC_CTRL" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XTAL_TRIM" edc:desc="Crystal Oscillator Load Capacitance Trimming" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="XTAL_TRIM_MIN" edc:desc="0.0 pF, trimming capacitors disconnected" edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="0.3 pF, trimming capacitor switched on" edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="..." edc:when="(field &amp; 0xF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="XTAL_TRIM_MAX" edc:desc="4.5 pF, trimming capacitor switched on" edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="XTAL_MODE" edc:desc="Crystal Oscillator Operating Mode" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="VAL_0x4" edc:desc="Internal crystal oscillator disabled; use external reference frequency." edc:when="(field &amp; 0xF) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xF" edc:desc="Internal crystal oscillator enabled; amplitude regulation of oscillation enabled." edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x153" edc:access="nnnnnnnn" edc:cname="CC_CTRL_0" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CC_NUMBER" edc:desc="Channel Number" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x154" edc:access="----nnnn" edc:cname="CC_CTRL_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CC_BAND" edc:desc="Channel Band" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x155" edc:access="nn--nnnn" edc:cname="RX_SYN" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX_PDT_LEVEL" edc:desc="Reduce Receiver Sensitivity" edc:nzwidth="0x4">
                <edc:SFRFieldSemantic edc:cname="RX_PDT_LEVEL_MIN" edc:desc="RX_THRES ≤ RSSI_BASE_VAL (Reset value); RSSI value not considered" edc:when="(field &amp; 0xF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x1" edc:desc="RX_THRES &gt; RSSI_BASE_VAL + 0 · 3; RSSI &gt; -90 dBm" edc:when="(field &amp; 0xF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x2" edc:desc="..." edc:when="(field &amp; 0xF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0xE" edc:desc="RX_THRES &gt; RSSI_BASE_VAL + 13 · 3; RSSI &gt; -51 dBm" edc:when="(field &amp; 0xF) == 0xE"/>
                <edc:SFRFieldSemantic edc:cname="RX_PDT_LEVEL_MAX" edc:desc="RX_THRES &gt; RSSI_BASE_VAL + 14 · 3; RSSI &gt; -48 dBm" edc:when="(field &amp; 0xF) == 0xF"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="RX_OVERRIDE" edc:desc="Receiver Override Function" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX_PDT_DIS" edc:desc="Prevent Frame Reception" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x156" edc:access="nnnnnnnn" edc:cname="TRX_RPC" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="XAH_RPC_EN" edc:desc="Smart Receiving in Extended Operating Modes Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IPAN_RPC_EN" edc:desc="Smart Receiving Mode IPAN Handling Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Res0" edc:desc="Reserved" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLL_RPC_EN" edc:desc="PLL Smart Receiving Mode Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PDT_RPC_EN" edc:desc="Smart Receiving Mode Reduced Sensitivity Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX_RPC_EN" edc:desc="Reciver Smart Receiving Mode Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX_RPC_CTRL" edc:desc="Smart Receiving Mode Timing" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0" edc:desc="Activates minimum power saving behaviour for smart receiving mode" edc:when="(field &amp; 0x3) == 0"/>
                <edc:SFRFieldSemantic edc:cname="VAL_1" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 1"/>
                <edc:SFRFieldSemantic edc:cname="VAL_2" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 2"/>
                <edc:SFRFieldSemantic edc:cname="VAL_3" edc:desc="Activates maximum power saving behaviour for smart receiving mode" edc:when="(field &amp; 0x3) == 3"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x157" edc:access="--nn-nn-" edc:cname="XAH_CTRL_1" edc:nzwidth="0x8" ltx:memberofperipheral="TRX24">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_PROM_MODE" edc:desc="Enable Promiscuous Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_ACK_TIME" edc:desc="Reduce Acknowledgment Time" edc:nzwidth="0x1">
                <edc:SFRFieldSemantic edc:cname="AACK_ACK_TIME_12_SYM" edc:desc="12 symbols acknowledgment time" edc:when="(field &amp; 0x1) == 0"/>
                <edc:SFRFieldSemantic edc:cname="AACK_ACK_TIME_2_SYM" edc:desc=" 2 symbols acknowledgment time" edc:when="(field &amp; 0x1) == 1"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_UPLD_RES_FT" edc:desc="Process Reserved Frames" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AACK_FLTR_RES_FT" edc:desc="Filter Reserved Frames" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
